[
    {
        "_comment": "See https://medlineplus.gov/about/data-files-api", 
        "name": "Cyclic vomiting syndrome", 
        "ghr_page": "https://medlineplus.gov/genetics/condition/cyclic-vomiting-syndrome", 
        "text-list": [
            {
                "text": {
                    "html": "<p>Cyclic vomiting syndrome is a disorder that causes recurrent episodes of nausea, vomiting, and tiredness (lethargy). This condition is diagnosed most often in young children, but it can affect people of any age.</p><p>The episodes of nausea, vomiting, and lethargy last anywhere from an hour to 10 days. An affected person may vomit several times per hour, potentially leading to a dangerous loss of fluids (dehydration). Additional symptoms can include unusually pale skin (pallor), abdominal pain, diarrhea, headache, fever, and an increased sensitivity to light (photophobia) or to sound (phonophobia). In most affected people, the signs and symptoms of each attack are quite similar. These attacks can be debilitating, making it difficult for an affected person to go to work or school.</p><p>Episodes of nausea, vomiting, and lethargy can occur regularly or apparently at random, or can be triggered by a variety of factors. The most common triggers are emotional excitement and infections. Other triggers can include periods without eating (fasting), temperature extremes, lack of sleep, overexertion, allergies, ingesting certain foods or alcohol, and menstruation.</p><p>If the condition is not treated, episodes usually occur four to 12 times per year. Between attacks, vomiting is absent, and nausea is either absent or much reduced. However, many affected people experience other symptoms during and between episodes, including pain, lethargy, digestive disorders such as gastroesophageal reflux and irritable bowel syndrome, and fainting spells (syncope). People with cyclic vomiting syndrome are also more likely than people without the disorder to experience depression, anxiety, and panic disorder. It is unclear whether these health conditions are directly related to nausea and vomiting.</p><p>Cyclic vomiting syndrome is often considered to be a variant of migraines, which are severe headaches often associated with pain, nausea, vomiting, and extreme sensitivity to light and sound. Cyclic vomiting syndrome is likely the same as or closely related to a condition called abdominal migraine, which is characterized by attacks of stomach pain and cramping. Attacks of nausea, vomiting, or abdominal pain in childhood may be replaced by migraine headaches as an affected person gets older. Many people with cyclic vomiting syndrome or abdominal migraine have a family history of migraines.</p><p>Most people with cyclic vomiting syndrome have normal intelligence, although some affected people have developmental delay or intellectual disability. Autism spectrum disorder, which affects communication and social interaction, have also been associated with cyclic vomiting syndrome. Additionally, muscle weakness (myopathy) and seizures are possible. People with any of these additional features are said to have cyclic vomiting syndrome plus.</p>", 
                    "text-role": "description"}}], 
                    "inheritance-pattern-list": [
                        {"inheritance-pattern": {
                            "code": "m", 
                            "memo": "mitochondrial"}}, 
                            {"inheritance-pattern": {
                                "code": "u", 
                                "memo": "Pattern unknown"}}], 
                                "related-gene-list": [{
                                    "related-gene": {
                                        "gene-symbol": "Mitochondrial DNA", 
                                        "ghr-page": "https://medlineplus.gov/genetics/chromosome/mitochondrial-dna"}}], 
                                        "synonym-list": [{"synonym": "Abdominal migraine"}, {
                                            "synonym": "CVS"}, {
                                                "synonym": "Cyclical vomiting"}, {
                                                    "synonym": "Cyclical vomiting syndrome"}, {
                                                        "synonym": "Periodic vomiting"}], 
                                                        "db-key-list": [
                                                            {"db-key": {
                                                                "db": "ICD-10-CM", 
                                                                "key": "G43.A"}}, {
                                                                    "db-key": {
                                                                        "db": "ICD-10-CM", 
                                                                        "key": "G43.A0"}}, {
                                                                            "db-key": {
                                                                                "db": "ICD-10-CM", 
                                                                                "key": "G43.A1"}}, {
                                                                                    "db-key": {
                                                                                        "db": "MeSH", 
                                                                                        "key": "D014839"}}, {
                                                                                            "db-key": {
                                                                                                "db": "OMIM", 
                                                                                                "key": "500007"}}, {
                                                                                                    "db-key": {"db": "SNOMED CT", "key": "18773000"}}], 
                                                                                                    "reviewed": "2014-03", "published": "2020-09-08"}]